{
  "stepTitle": "Experimentarea pre-testului",
  "steps": [
    {
      "id": 1,
      "title": "Ce înseamnă aceasta?",
      "description": "Un pre-test este o versiune de încercare a testului, aplicată unui grup mic de persoane, pentru a verifica dacă întrebările sunt clare și dacă testul măsoară ce trebuie."
    },
    {
      "id": 2,
      "title": "Aplică testul unui grup mic",
      "description": "Recomandarea este să aplici testul unui grup de 30–100 de elevi, preferabil reprezentativ pentru publicul țintă."
    },
    {
      "id": 3,
      "title": "Colectează feedback",
      "description": "Întreabă participanții dacă au înțeles întrebările, dacă testul a fost prea dificil sau prea ușor și dacă a existat ceva confuz sau ambigu."
    },
    {
      "id": 4,
      "title": "Analizează rezultatele",
      "description": "Verifică întrebările care au avut prea multe răspunsuri greșite sau corecte. Acest lucru poate indica faptul că întrebarea este prea dificilă, prea ușoară sau neclar formulată."
    },
    {
      "id": 5,
      "title": "Ajustează testul",
      "description": "Pe baza feedback-ului și a datelor colectate, modifică itemii problematici, clarifică formulările și reechilibrează nivelul de dificultate al testului."
    },
    {
      "id": 6,
      "title": "Checklist pentru experimentarea pre-testului",
      "checklist": [
        "[Aplicare] A fost testul aplicat unui grup suficient de reprezentativ (30–100 de elevi)?",
        "[Aplicare] Grupul a fost similar cu publicul țintă final?",
        "[Feedback] Ai întrebat dacă întrebările au fost clare și bine înțelese?",
        "[Feedback] Ai primit observații legate de nivelul de dificultate?",
        "[Analiză] Ai identificat întrebările cu rată mare de răspunsuri greșite sau prea ușoare?",
        "[Analiză] Ai detectat itemi care pot fi ambigui sau prea complicați?",
        "[Revizuire] Ai modificat itemii cu probleme pe baza datelor?",
        "[Revizuire] Ai păstrat un echilibru al dificultății în testul final?"
      ]
    }
  ]
}
